In [1]:
import pandas as pd

In [78]:
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

In [55]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    salaries = employee['salary'].drop_duplicates().sort_values(ascending=True)
    second = salaries.iloc[1] if len(salaries) >= 2 else None
    return pd.DataFrame({'SecondHighestSalary': [second]})

In [56]:
second_highest_salary(employee)

  SecondHighestSalary
0                None

In [77]:
def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    salaries = employee['salary'].drop_duplicates().sort_values(ascending=True)
    if len(salaries) >= N:
        nth = salaries.iloc[N-1]
    elif len(salaries) == 1 and N == 1:
        nth = salaries.iloc[0]
    else:
        nth = None
    col_name = f"getNthHighestSalary({N})"
    return pd.DataFrame({col_name: [nth]})
nth_highest_salary(employee, 3)

  getNthHighestSalary(3)
0                   None

In [80]:
employee['salary'].drop_duplicates().sort_values(ascending=True).iloc[1-1]

np.int64(100)

### Rank score

In [104]:
import pandas as pd

data = [[1, 3.5], [2, 3.65], [3, 4.0], [4, 3.85], [5, 4.0], [6, 3.65]]
scores = pd.DataFrame(data, columns=['id', 'score']).astype({'id':'Int64', 'score':'Float64'})

def order_scores(scores: pd.DataFrame) -> pd.DataFrame:
    score = scores['score'].sort_values(ascending=False, )
    r = 1; rank = [0]*len(score)
    for idx in range(len(score)):
        if idx == 0:
            rank[idx] = r
        else:
            if score.iloc[idx] == score.iloc[idx-1]:
                rank[idx] = r
            else:
                r += 1
                rank[idx] = r
    return pd.DataFrame({'score': score, 'rank': rank})
order_scores(scores)

   score  rank
4    4.0     1
2    4.0     1
3   3.85     2
1   3.65     3
5   3.65     3
0    3.5     4

최적화

In [ ]:
result = scores.sort_values('score', ascending=False)
result['rank'] = result['score'].rank(method='dense', ascending=False).astype(int)
result[['score', 'rank']]

   id  score
4   5    4.0
2   3    4.0
3   4   3.85
1   2   3.65
5   6   3.65
0   1    3.5

In [121]:
data = [[1, 3.5], [2, 3.65], [3, 4.0], [4, 3.85], [5, 4.0], [6, 3.65]]
scores = pd.DataFrame(data, columns=['id', 'score']).astype({'id':'Int64', 'score':'Float64'})

scores['rank'] = scores['score'].rank(method='dense', ascending=False).astype(int)
scores[['score', 'rank']].sort_values(by='rank',ascending=True)

   score  rank
2    4.0     1
4    4.0     1
3   3.85     2
1   3.65     3
5   3.65     3
0    3.5     4

sample code

In [122]:
import pandas as pd

def order_scores(scores: pd.DataFrame) -> pd.DataFrame:
    scores["rank"] = scores["score"].rank(method="dense", ascending=False).astype(int)
    return scores[["score", "rank"]].sort_values(by="score", ascending=False)
order_scores(scores)

   score  rank
4    4.0     1
2    4.0     1
3   3.85     2
1   3.65     3
5   3.65     3
0    3.5     4

### Consecutive numbers

Find all numbers that appear at least three times consecutively.

Return the result table in any order.

The result format is in the following example.

In [ ]:
import pandas as pd

data = [[1, 1], [2, 1], [3, 1], [4, 2], [5, 1], [6, 2], [7, 2]]
logs = pd.DataFrame(data, columns=['id', 'num']).astype({'id':'Int64', 'num':'Int64'})

def consecutive_numbers(logs: pd.DataFrame) -> pd.DataFrame:
    n = logs['num']
    cn = []; cnt = 0; check = logs['num']
    for i in range(len(check)-1):
        if check[i] == check[i+1]:
            cnt += 1
        else:
            cn

claude 최적화

**shift** 사용법

In [ ]:
data = [[1, 1], [2, 1], [3, 1], [4, 2], [5, 1], [6, 2], [7, 2]]
logs = pd.DataFrame(data, columns=['id', 'num']).astype({'id':'Int64', 'num':'Int64'})

def consecutive_numbers(logs: pd.DataFrame) -> pd.DataFrame:
    logs = logs.sort_values(by='id', ascending=True)
    check = (logs['num'] == logs['num'].shift(-1)) & (logs['num'] == logs['num'].shift(-2))
    con_nums = logs.loc[]

In [151]:
check = (logs['num'] == logs['num'].shift(-1)) & (logs['num'] == logs['num'].shift(-2))
logs.loc[[False,True, False, False, False, False, False], 'num']

1    1
Name: num, dtype: Int64

In [141]:
print(logs['num'] == logs['num'].shift(-1))
print(logs['num'] == logs['num'].shift(-2))
(logs['num'] == logs['num'].shift(-1)) & (logs['num'] == logs['num'].shift(-2))

0     True
1     True
2    False
3    False
4    False
5     True
6     <NA>
Name: num, dtype: boolean
0     True
1    False
2     True
3     True
4    False
5     <NA>
6     <NA>
Name: num, dtype: boolean

0     True
1    False
2    False
3    False
4    False
5     <NA>
6     <NA>
Name: num, dtype: boolean

### Employees earning more than their managers

In [ ]:
import pandas as pd
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

def find_employees(employee: pd.DataFrame) -> pd.DataFrame:
    merged = employee.merge(employee, left_on='managerId', right_on=)

In [196]:
employee.merge(
    employee, 
    left_on='managerId', 
    right_on='id', 
    suffixes=('', '_manager')
)

,id,name,salary,managerId,id_manager,name_manager,salary_manager,managerId_manager
0,1,Joe,70000,3,3,Sam,60000,<NA>
1,2,Henry,80000,4,4,Max,90000,<NA>

In [182]:
ans = merged[merged['salary'] > merged['salary_manager']]
ans[['name']].rename(columns={'name': 'Employee'})

  Employee
0      Joe

In [ ]:
ans

,id,name,salary,managerId,id_manager,name_manager,salary_manager,managerId_manager
0,1,Joe,70000,3,3,Sam,60000,<NA>

ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

## 262. Trip and Users

The cancellation rate is computed by dividing the number of canceled (by client or driver) requests with unbanned users by the total number of requests with unbanned users on that day.

Write a solution to find the cancellation rate of requests with unbanned users (both client and driver must not be banned) each day between "2013-10-01" and "2013-10-03" with at least one trip. Round Cancellation Rate to two decimal points.

Return the result table in any order.

The result format is in the following example.

## 550. Game play analysis

Write a solution to report the fraction of players that logged in again on the day after the day they first logged in, rounded to 2 decimal places. In other words, you need to determine the number of players who logged in on the day immediately following their initial login, and divide it by the number of total players.

The result format is in the following example.

In [1]:
import pandas as pd

data = [[1, 2, '2016-03-01', 5], [1, 2, '2016-03-02', 6], [2, 3, '2017-06-25', 1], [3, 1, '2016-03-02', 0], [3, 4, '2018-07-03', 5]]
activity = pd.DataFrame(data, columns=['player_id', 'device_id', 'event_date', 'games_played']).astype({'player_id':'Int64', 'device_id':'Int64', 'event_date':'datetime64[ns]', 'games_played':'Int64'})
activity

   player_id  device_id event_date  games_played
0          1          2 2016-03-01             5
1          1          2 2016-03-02             6
2          2          3 2017-06-25             1
3          3          1 2016-03-02             0
4          3          4 2018-07-03             5

In [2]:
def gameplay_analysis(activity: pd.DataFrame) -> pd.DataFrame:
    activity['right_after_event_date'] = activity['event_date'] + pd.Timedelta(days=1)
    merged = activity.merge(activity, left_on='right_after_event_date', right_on='event_date')
    v = round(len(merged['player_id_x'].unique()) / len(activity['player_id'].unique()),2)
    return pd.DataFrame({'fraction': [v]})
gameplay_analysis(activity)

   fraction
0      0.33

In [3]:
activity['right_after_event_date'] = activity['event_date'] + pd.Timedelta(days=1)
activity

   player_id  device_id event_date  games_played right_after_event_date
0          1          2 2016-03-01             5             2016-03-02
1          1          2 2016-03-02             6             2016-03-03
2          2          3 2017-06-25             1             2017-06-26
3          3          1 2016-03-02             0             2016-03-03
4          3          4 2018-07-03             5             2018-07-04

In [35]:
activity.sort_values(['player_id','event_date'], inplace=True)
activity['right_after_event_date'] = activity['event_date'] + pd.Timedelta(days=1)
activity['check'] = activity['right_after_event_date'].shift(1)
target = activity[activity['event_date'] == activity['check']]
target

,player_id,device_id,event_date,games_played,right_after_event_date,check
1,1,2,2016-03-02,6,2016-03-03,2016-03-02

In [42]:
len(target['player_id'].unique())

1

In [6]:
q = [1,2,5,8,4]
for i in range(len(q)):
    q[i] //= 2
q

[0, 1, 2, 4, 2]